{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "conv2d_15_input"}, "name": "conv2d_15_input", "class_name": "InputLayer"}, {"inbound_nodes": [[["conv2d_15_input", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "strides": [1, 1], "batch_input_shape": [null, 128, 128, 3], "kernel_constraint": null, "name": "conv2d_15", "kernel_regularizer": null}, "name": "conv2d_15", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "name": "activation_29", "class_name": "Activation"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_16", "kernel_regularizer": null}, "name": "conv2d_16", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "name": "activation_30", "class_name": "Activation"}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_8", "pool_size": [2, 2]}, "name": "max_pooling2d_8", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_15", "noise_shape": null}, "name": "dropout_15", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_15", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_8"}, "name": "flatten_8", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "dense_15", "kernel_regularizer": null, "units": 64}, "name": "dense_15", "class_name": "Dense"}, {"inbound_nodes": [[["dense_15", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_31"}, "name": "activation_31", "class_name": "Activation"}, {"inbound_nodes": [[["activation_31", 0, 0, {}]]], "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_16", "noise_shape": null}, "name": "dropout_16", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_16", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "dense_16", "kernel_regularizer": null, "units": 10}, "name": "dense_16", "class_name": "Dense"}, {"inbound_nodes": [[["dense_16", 0, 0, {}]]], "config": {"trainable": true, "activation": "softmax", "name": "activation_32"}, "name": "activation_32", "class_name": "Activation"}], "input_layers": [["conv2d_15_input", 0, 0]], "name": "sequential_8_model", "output_layers": [["activation_32", 0, 0]]}, "keras_version": "2.1.2", "class_name": "Model"}